/**************************************************************************
<File Name>		:Pcbchk.h
<Function>		:P板検査制御
<Program>		:
<Author>		:村上 和宏
<Date>			:14/03/19
<Update>		:
<Copyright>		:Panasonic Refrigeration Co.,Ltd.
**************************************************************************/
/********************************************/
/*		      マクロ定義					*/
/********************************************/

#define	IMAX	0xC0			/* MAX電流検知閾値 3.76V相当 */
#define	IMIN	0x59			/* MIN電流検知閾値 2.76V相当 */

#define	T_CHARGE	3			/* 充電時間	  60ms (= 3 x 20ms )	*/
#define	T_WAIT		1			/* 短絡防止時間 20ms (=1 x 20ms)	*/
#define	T_OUT		5			/* 出力時間	  	100ms (= 5 x20ms)	*/
#define	T_STOP		3			/* 出力停止時間	  60ms (= 3 x 20ms )	*/
#define	T_HEATON	150			/* ﾋｰﾀ出力時間	3s    (= 150 x 20ms )*/						/* @031MyOTM[17/04/04] */	/* @014lxHOM[24/12/03] */

#define	NUM_SELMOD  1			/* ﾋｰﾀ出力ﾓｰﾄﾞ数 仕様変更により3s間ヒータすべてONした後、全OFFとする。モードは0,1の2つ*/			/* @014lxHOM[24/12/03] */


/*
*******************************************************************************************************************
巻き線保護制御に利用するADポートの検査を行うため、閾値を2つ設けて検査を実施する。
ばらつきを考慮して閾値を調整する割合（SHUNTADNUM_MIN）、閾値2つ（SHUNTADPORT_TH1、SHUNTADPORT_TH2）を定義する。
検査ではAD入力平均値α（4つの移動平均値をとる）を生成し、検査閾値TH1、TH2（0<TH1<TH2<4095)と比較する。
このときAD値は12bitで取得してUI16変数に格納していることを注意する。
AD入力平均値に対してマイコンコード出力ON(上位bit下位bit)・OFF切替えを行う。
閾値は検査治具のばらつきを考慮する。
--------------------------------------------------------------------------------             
0--------------------------------------TH1-----------------------TH2---------------------4095->
|             マイコンコード出力OFF        |  上位4bit出力し続ける   |    下位4bit出力し続ける  |
<----------------------------------------><-----------------------><-------------------------->


*******************************************************************************************************************
*/
#define SHUNTADNUM_MIN 90	/* 印加電圧と抵抗のばらつきおよび回路のばらつきによって発生するシャントAD値は理論値に対して定義値（％）のばらつきを許容する */
#define SHUNTADPORT_TH1 ((3002 * SHUNTADNUM_MIN)/100)	/* ADポート閾値（12bit 0~4095で設定）ばらつきを考慮して設定*/
#define SHUNTADPORT_TH2 ((3820 * SHUNTADNUM_MIN)/100)	/* ADポート閾値（12bit 0~4095で設定）ばらつきを考慮して設定*/

#define UPPER_ARM_ON	!(UPPER_ARM^SET)	/*RAM使用量の増加をせず可読性を高めるためON/OFF設定値を定義*//* @008lwORM[24/06/21] */
#define UPPER_ARM_OFF	!(UPPER_ARM^RESET)	/*RAM使用量の増加をせず可読性を高めるためON/OFF設定値を定義*//* @008lwORM[24/06/21] */
#define LOWER_ARM_ON	!(LOWER_ARM^SET)	/*RAM使用量の増加をせず可読性を高めるためON/OFF設定値を定義*//* @008lwORM[24/06/21] */
#define LOWER_ARM_OFF	!(LOWER_ARM^RESET)	/*RAM使用量の増加をせず可読性を高めるためON/OFF設定値を定義*//* @008lwORM[24/06/21] */

enum MCUCode_OutputPattern{
	Output_Non = 0,	/* 出力OFF */
	Output_HB,		/* マイコンコード上位4bit出力 */
	Outout_LB		/* マイコンコード下位4bit出力 */
};

#define ARRNUM_ADAVEBUF 4		/* AD変換結果の配列要素数 */

/*
******************************************************************************
 可読性を高めるためARMのON・OFF設定値を定義した。定義に至った思想や具体的手法は下記
 設計思想：上下アームの極性定義値変更のみで対応できる出力定義値を作りたい
 課題：Polalityによって出力値の意味合い（例参照）が変化するので出力値の変更対応が必要
 例：LoActiveならRESET(0)出力は真条件だがHiActiveならRESET(0)出力は偽条件となる
 解決手法：Polalityとset-levelの排他的論理和を取って否定論理をつけると成立
 解説：output(X)のXはPolalityによって意味が異なる。しかし計算論理は変更なしで成立する
 
|----------------||--------------------------||--------------|--------------|
|   output!(XOR) || Polality XOR set-level   ||   Polality   |  set-level   |	
|________________||__________________________||______________|______________|
|HI_ACTIVE ON(1) ||           0              ||              |   SET(1)     |
|----------------||--------------------------|| HI_ACTIVE(1) |--------------|
|HI_ACTIVE OFF(0)||           1              ||              |   RESET(0)   |
|----------------||--------------------------||--------------|--------------|
|LO_ACTIVE ON(0) ||           1              ||              |   SET(1)     |
|----------------||--------------------------|| LO_ACTIVE(0) |--------------|
|LO_ACTIVE OFF(1)||           0              ||              |   RESET(0)   |
|----------------||--------------------------||--------------|--------------|
 まとめ：この計算論理を使って上下アームのON・OFFを定義することでPolalityの変更だけで
 出力値を合わせる変更は不要となる。
*****************************************************************************
*/
#define FO_INIT_STATE   !(FO_POLALITY)    /*FOピンの出力が設定した極性と同じ電圧レベルのときに真（故障出力）条件となるため、初期値は極性の論理否定値となる*//* @008lwORM[24/06/21] */
/*
******************************************************************************
FO(Fault-Output)->故障出力機能とは：
IPMから過電流や短絡、過熱などの異常が検出された際に出力信号が生成され
外部の制御回路や保護回路へ通知する機能である
通知する出力信号は0または1のどちらかでモジュールによって異なる（極性が異なるという）
通知する出力信号が0ならLo-Active、1ならHi-Activeと呼ばれる。
制御回路側から考えたとき、故障していなければ出力信号に対して反転した値が入力される
したがって初期値は極性の論理否定値が設定される
******************************************************************************
*/
extern void vTEST_IPM_OutputOFF(void);
extern void vTEST_IPM_GPIO_Init(void);
extern void vTEST_Set_McuCodeoutputState(void);
extern UI08 vTEST_Get_McuCodeOutputState(void);
extern uint16_t ad_data_arr[8]; //adc データの格納先
