#ifndef REFGE_RAM_H
#define REFGE_RAM_H

/**************************************************************************
#ifdef DOC
File Name		：ram.h
Function		：
Description		：RAMヘッダファイル
Program			：
Author			：小柳　英二郎
Date			：05/04/26
Update			：05/05/27 REF051-1.01 仕様変更RAM設定
				：05/05/30 REF051-1.02 EEPROMSUM値追加
				：05/06/07 REF051-1.03 仕様変更RAM設定
				：05/06/09 REF051-1.04 徐冷冷却ﾓｰﾄﾞ設定追加
				：05/06/10 REF051-1.05 ﾌﾟﾘｸｰﾙ用RAM設定追加
				：05/06/21 REF051-1.06 温度履歴書込み判定ﾀｲﾏ、離氷回数、ﾊﾟｲﾌﾟﾋｰﾀ演算許可、PCﾄﾞｱ確定F追加
				：05/06/24 REF051-1.07 製氷お掃除確定追加
				：05/06/27 REF051-1.08 製氷ﾌｧﾝ積算ﾀｲﾏ位置変更
				：05/07/08 REF051-1.09 PCﾀﾞﾝﾊﾟ微開ﾓｰﾄﾞ、ICCｺﾝﾌﾟON/OFF温度追加
										実省エネ用ﾄﾞｱｶｳﾝﾄ追加
				：05/07/11 REF051-1.10 TﾀﾞﾝﾊﾟﾓｰﾀIC変更に伴う出力ﾌﾗｸﾞ追加
										ｺﾝﾌﾟ回転数DOWN用追加
				：05/07/14 REF051-1.11 ﾊﾟﾜｰ冷凍前設定RAM追加
				：05/07/20 REF051-1.12 ﾃﾞﾌ周期用ﾄﾞｱ開RAM追加
				：05/08/29 REF05A-2.00 実省エネATC追加
				：05/09/05 REF05A-2.01 実省エネPCﾄﾞｱ関連RAM追加
				：05/09/14 REF05A-2.02 実省エネﾄﾞｱ開追加
				：05/09/21 REF05A-2.03 実省エネﾓｰﾄﾞｺﾝﾌﾟ追加
				：05/10/03 REF05A-2.04 SC温調用RAM追加
				：05/10/12 REF05A-2.07 T6ﾓｰﾄﾞ、製氷用ｺﾝﾌﾟ積算、PCﾀﾞﾝﾊﾟ開積算ﾀｲﾏ追加
				：05/10/19 REF05A-2.09  速氷t7ﾀｲﾑUP追加
				：05/11/22 REF05E-3.01 実省エネﾓｰﾄﾞ6時間解除判定追加
				：07/04    規約対応
				：07/05/08 TEST1/TEST2入替
				：07/05/16 ｴﾝﾄﾘRAMｱﾄﾞﾚｽ修正 @002acOTT[07/05/08] 
				：07/07/04 B32M1 過負荷検知判定追加
				：09/12/24 BU343 UPD78F0512 要求仕様実装 (KEY:BU343_000, BU343_002)
				：10/02/16 BU343 ﾌｧﾝ遅延制御用変数追加 @003IxDOD[10/02/16]
				: 10/10/21 BW465  村上 AD値取得処理整備 @007MwDOD[10/10/21]
				: 10/11/01 BW465  村上 三菱IPM基板用IO対応 @013MwDOD[10/11/01]
				: 10/11/25 BW465 コンプ急凍制御インプリ 村上 @022MwDOD[10/11/22]
				: 10/11/25 BW465 HCリーク制御追加 村上 @024MwDOD[10/11/22]
				: 10/11/22 BW465 ﾃﾞﾌﾛｽﾄ制御仕様変更 村上	@020MwDOD[10/11/22]
				: 10/12/08 BW465 デバッグ用出力変数追加 村上 @037MwDOD[10/12/08]
				: 14/04/07 BL7/BR7  エコナビ処理移設  Hieu (村上)	@082MzDOD[14/04/07] 
Copyright		：Panasonic Refrigeration Co.,Ltd.
#endif
**************************************************************************/


/* 時タイマ関連 */
	#define		TMHCT		1						/*時間ﾀｲﾏ数*/
	/*#define stg_TIMEH_fcfrtm		stg_TIMEH[0]*/


/* 分タイマ関連 */
	#define		TMMCT		1						/*分ﾀｲﾏ数*/
	#define stg_TIMEM_heatertm		stg_TIMEM[0]		/* ﾋｰﾀﾀｲﾏ(分)	*/		/* @057sxDOD[19/09/10] */


/* 秒タイマ関連 */
	#define		TMSCT		1						/*秒ﾀｲﾏ数*/
	#define stg_TIMES_heatertm		stg_TIMES[0]		/* ﾋｰﾀﾀｲﾏ		*/		/* @005MzDOD[16/10/04] */

#endif /* REFGE_RAM_H */

