/**************************************************************************
<FileName>		:DTYCTRL.h
<Function>		:DTYCTRL.c用ヘッダファイル
<Program>		:Caution> "_ADCONV0()"は電圧読み込み処理ﾙｰﾁﾝ"vMAIN_Getvlt()"の46ﾏｼﾝｻｸﾙ以上前に置くこと！！
<Author>		:大内山 智則 -Outi
<Date>			:2002-0125
<Update>		:Ver REF02A-0.00 2002-05-15
				:Ver REF045-4.00 2004-08-04 -Outi 静的解析結果対応(if/else文｛｝追加)
				:Ver REF070-0.01 2007-04-09 -Tomo 機種切り替え対応
				:Ver REF070-0.02 2007-04-18 -Tomo 機種切り替え対応
				:Ver REF081-0.00 2008-04-22 -Outi ﾙﾈｻｽMCU置換対応
<Copyright>		:Matsushita Refrigerator Co. , Ltd.
**************************************************************************/
#ifndef DTYCTRL_H_
#define DTYCTRL_H_
/*********************************************/
/*		    インクルードファイル					 */
/*********************************************/
#include	"Sys_type.h"

/*********************************************/
/*		      マクロ定義						 */
/*********************************************/

/********************************************/
/*		      外部変数参照						*/
/********************************************/
extern UI08 uc2LV_enry;					/*昇降圧関連ﾌﾗｸﾞ格納RAM from"_DRVRY" */
		/*   ---- ---1 ;2LVﾌｪｰﾙｾｰﾌ･ﾓｰﾄﾞ･ﾌﾗｸﾞ */
		/*   ---- --1- ;過電圧判定許可ﾌﾗｸﾞ */
		/*   ---- -1-- ;運転中ﾘﾚｰ昇圧ﾌﾗｸﾞ */
		/*   ---- 1--- ;回転数ﾘﾐｯﾀ仕様ﾌﾗｸﾞ 0:通常 1:ﾘﾐｯﾀ作動中ﾓｰﾄﾞ */
		/*   ---1 ---- ;ﾘﾚｰ動作ﾌﾗｸﾞ 0:ON動作 1:OFF動作 */
		/*   --1- ---- ;ﾘﾚｰ状態ﾌﾗｸﾞ 0:OFF状態 1:ON状態 */
		/*   -1-- ---- ;Duty減算ﾌﾗｸﾞ  0:加算  R_NOWDTY >= R_PSTDTY  1:減算  R_NOWDTY < R_PSTDTY */
		/*   1--- ---- ;昇圧中ﾌﾗｸﾞ 0:昇圧以外 1:昇圧中(500ms間) */
extern UI08 ucMAIN_vltnow;				/*現在の電圧(AIN0A/D変換値) */
extern UI16	unPMDc_dutyn;				/* Duty(PWMｵﾝ幅Amplitude). */

/*******************************************
		プロトタイプ宣言
 *******************************************/									/*電圧読込処理 */
void ControlDuty(UI08 is_angle_min);
/* UI08 IsVoltBoosted(void); */
/* void InitPamDuty(void); */
UI08 IsDutyFull(void);
UI08 vltrecovery(UI08 vltmax, UI08 vltmax_p);

#endif /* #ifndef DTYCTRL_H_ */
